Repository: 84000/data-translation-memory
Catalog: toh321-v3.tmx
Source language: bo
Languages: en

source: མཆོད་རྟེན་བསྐོར་བའི་ཚིགས་སུ་བཅད་པ།
en: The Verses on Circumambulating Shrines

source: དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Three Jewels.

source: ཤེས་རབ་བློ་ལྡན་འཇིག་རྟེན་ན། །ཆོས་ཀྱི་འཁོར་ལོ་རྗེས་བསྐོར་བ། །ཤེས་རབ་ཆེན་པོ་ཤཱ་རིའི་བུས། །སྟོན་པ་ལ་ནི་ཞུ་བ་ཞུས། །
en: Śāriputra, the greatly wise one, Foremost among those with wisdom, Who turns the wheel of Dharma in the world, Asked the Teacher a question.

source: མཆོད་རྟེན་བསྐོར་བ་བགྱིས་པ་ཡིས། །རྣམ་པར་སྨིན་པ་ཅིར་འགྱུར་བ། །
en: “What karmic result will there be For those who circumambulate a shrine?

source: སྐལ་བ་ཆེན་པོའི་འཇིག་རྟེན་མཆོག །རྣམ་པར་འདྲེན་པས་བདག་ལ་གསུངས། །
en: Illustrious one, supreme in the world, Perfect guide, please tell me.”

source: རྫོགས་པའི་སངས་རྒྱས་རྐང་གཉིས་མཆོག །སྟོན་པས་དེ་ལ་བཀའ་སྩལ་པ། །མཆོད་རྟེན་བསྐོར་བ་བྱས་པ་ཡི། །ཡོན་ཏན་གང་ཡིན་ཕྱོགས་ཙམ་བསྟན། །
en: The best of those who walk on two feet, The teacher, the perfect Buddha, answered, “I will only teach a portion of the virtues Of those who circumambulate a shrine.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པ་ཡིས། །ལྷ་ཀླུ་གནོད་སྦྱིན་དྲི་ཟ་དང་། །ལྷ་མིན་མཁའ་ལྡིང་མིའམ་ཅི། །ལྟོ་འཕྱེ་ཆེ་རྣམས་མཆོད་བྱེད་འགྱུར། །
en: “Those who circumambulate a shrine Shall be honored everywhere By devas, nāgas, and likewise by yakṣas, And, indeed, by piśācas and rākṣasas.

source: དལ་བ་རྙེད་དཀའ་ཐོབ་གྱུར་ནས། །སྐད་ཅིག་གཅིག་ཙམ་བར་དུ་ཡང་། །མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །མི་ཁོམ་བརྒྱད་རྣམས་སྤོང་བར་འགྱུར། །
en: “Those who circumambulate a shrine, Even only a single time, Having gained the opportunity so hard to find, Will be freed from the eight inopportune states.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །དྲན་དང་ལྡན་ཞིང་བློ་གྲོས་ལྡན། །ཁ་དོག་ལྡན་ཞིང་མཛངས་པ་དང་། །ཐམས་ཅད་དུ་ནི་མཆོད་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will possess mindfulness, intelligence, Beauty, and clearsightedness, And be honored everywhere.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ལྷ་དང་དེ་བཞིན་མི་རྣམས་ཀྱིས། །ཚེ་རིང་བ་ཡང་དེ་ཡིས་འཐོབ། །གྲགས་པ་ཆེན་པོའང་འཐོབ་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will acquire a long lifespan As a god or likewise as a human, And great renown too.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །འཛམ་བུའི་གླིང་དུ་རུས་ཀྱི་མཆོག །ཆོ་རིགས་ཡོངས་སུ་དག་པར་ཡང་། །བློ་ལྡན་དེ་ནི་སྐྱེ་བར་འགྱུར། །
en: “Those who circumambulate a shrine Will be born possessing intelligence And also a lineage that is pure In the foremost clan in Jambūdvīpa.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ཁ་བཞིན་དག་ཀྱང་བཟང་བ་དང་། །མདོག་སྡུག་པ་དང་མཁས་པ་དང་། །
en: “Those who circumambulate a shrine Will have a kind and pure countenance, A good complexion, and be bright too.

source: བདེ་བར་གནས་པ་ཐོབ་པར་འགྱུར། །
en: They will dwell in happiness.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ཕྱུག་ཅིང་ནོར་ཡང་མང་བ་དང་། །
en: “Those who circumambulate a shrine Will have great wealth and riches.

source: སེར་སྣ་མེད་ཅིང་གཏོང་ཕོད་དང་། །སྦྱིན་པ་དག་ལ་དགའ་བར་འགྱུར། །
en: They will not be miserly, but generous, And will take pleasure in giving.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །
en: “Those who circumambulate a shrine Will achieve great prosperity.

source: ཡིད་དུ་འོང་ཞིང་བལྟ་ན་སྡུག །མདོག་བཟང་མཐོང་ན་དགའ་བ་དང་། །
en: They will be beautiful and gorgeous, With an attractive and lovely skin tone.

source: ལོངས་སྤྱོད་རྒྱ་ཆེན་སྤྱོད་པར་འགྱུར། །མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །འདུ་བྱེད་སྟོང་པར་མཐོང་ནས་ཀྱང་། །དེ་ནི་ཆོས་ལ་རྨོངས་མི་འགྱུར། །མྱུར་དུ་དགའ་བ་ཐོབ་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will not be deluded about phenomena, Seeing conditioned things as empty, And will quickly obtain happiness.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །རྒྱལ་རིགས་མཆོག་ཏུ་སྐྱེ་བར་འགྱུར། །བུ་སྨད་འཁོར་དང་ལྡན་པ་དང་། །སྟོབས་དང་བརྩོན་འགྲུས་ལྡན་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will be born as a most excellent kṣatriya, Surrounded by a wife and children, And endowed with strength and vigor.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བར་སྐྱེ། །ཚུལ་ཁྲིམས་ལྡན་ཞིང་ཐོས་དང་ལྡན། །རིག་བྱེད་གསང་སྔགས་ལྡན་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will be born as a great landowning brahmin, Endowed with moral discipline and learning, With knowledge of the Vedas and mantras.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བར་སྐྱེ། །ཕྱུག་ཅིང་ནོར་ཡང་མང་བ་དང་། །ནོར་དང་འབྲུ་རྣམས་ལྡན་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will be born as a great landowning householder, Having much wealth and many riches, With grain and cattle in abundance.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །འཛམ་བུའི་གླིང་གི་མངའ་བདག་རྗེ། །ས་སྟེང་མཐའ་དག་དབང་བྱེད་པའི། །ཆོས་དང་ལྡན་པའི་རྒྱལ་པོར་འགྱུར། །
en: “Those who circumambulate a shrine Will become lord and sovereign of Jambūdvīpa, A righteous king whose rule extends To the ends of the earth.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །རིན་ཆེན་བདུན་དང་ལྡན་པ་ཡི། །འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར། །ཆོས་བཞིན་འཁོར་ལོ་སྐོར་བར་བྱེད། །
en: “Those who circumambulate a shrine Will become a wheel-turning king, Possessing the seven royal treasures, And roll the wheel according to the Dharma.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །འདི་ནས་འཕོས་ནས་མཐོ་རིས་འགྲོ། །སངས་རྒྱས་བསྟན་ལ་དགའ་བ་དང་། །རྣལ་འབྱོར་ལྡན་ཞིང་རྫུ་འཕྲུལ་ཆེ། །
en: “Those who circumambulate a shrine Will go to higher realms once they pass on from here, Find joy in the Buddha’s teachings, Become yogins, and gain great miraculous powers.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ལྷ་ཡུལ་དག་ནས་འཕོས་ནས་ཀྱང་། །དེ་ནི་མི་ཡི་ནང་དུ་སྐྱེ། །རྨོངས་པ་མེད་པར་མངལ་དུ་འཇུག །
en: “Those who circumambulate a shrine, After passing on from the divine realms, Will be reborn again among humans, Entering the womb without delusion.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །མངལ་གྱི་སྐྱོན་གྱི་དྲི་མ་ཡིས། །དེ་ལ་གོས་པར་མི་འགྱུར་ཏེ། །དེ་ནི་ནོར་བུ་དག་པ་བཞིན། །
en: “Those who circumambulate a shrine Will not become tainted By the impurities and flaws of the womb; They will be like a pure jewel.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །མ་ལྟོར་བདེ་བར་གནས་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will dwell at ease inside their mothers.

source: དེ་ནི་བདེ་བར་བཙའ་བ་དང་། །བདེ་བར་ནུ་ཞོ་འཐུང་བར་འགྱུར། །
en: They will be at ease as they are born; At ease they will suckle their mothers’ breasts.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ཕས་ཀྱང་གཡོག་འཁོར་མང་པོ་ཡིས། །དེ་ལ་གསོ་ཞིང་གནས་པར་འགྱུར། །མ་མས་རྟག་ཏུ་རིམ་གྲོ་བྱེད། །
en: “Those who circumambulate a shrine Will be supported and nourished by many servants, As well as by their fathers, And always cared for by nurses.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ཉེ་དུ་རྣམས་ཀྱི་སྙིང་དུ་སྡུག །དེ་བཞིན་ཕ་མ་ལྷག་པར་བྱམས། །སྐྱེས་ནས་ལོངས་སྤྱོད་འཕེལ་བར་འགྱུར། །
en: “Those who circumambulate a shrine Will prosper right from birth, Be dearly beloved of relatives, And especially doted upon by parents.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ཤ་ཟ་དང་ནི་སྲིན་རྣམས་ཀྱིས། །དེ་ལ་གནོད་པར་མི་འགྱུར་ཏེ། །
en: “Those who circumambulate a shrine Will not be able to be harmed By piśācas or rākṣasas.

source: ལོངས་སྤྱོད་དག་ལ་སྐྱོན་མེད་སྤྱོད། །
en: They will enjoy unhindered abundance.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །བསྐལ་པ་བརྒྱར་ཡང་དེ་དག་རྣམས། །ཞར་བ་གྲུམ་པོར་ཡོང་མི་འགྱུར། །ལུས་ཀྱང་རྣམ་པར་དག་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will have an immaculate body And never be blind or crippled, Through hundreds of eons.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །མིག་ཀྱང་རྣམ་པར་དག་པར་འགྱུར། །དཀྱུས་རིང་མཐོན་མཐིང་སྡུག་པ་དང་། །ལྷ་ཡི་མིག་ཀྱང་དེ་ཡིས་འཐོབ། །
en: “Those who circumambulate a shrine Will have perfectly clear eyes, Long and shapely, dark, alluring, And also obtain the divine eye.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ལུས་བདེ་སེམས་ཀྱང་བརྟན་པ་དང་། །དེ་བཞིན་བརྩོན་འགྲུས་བརྟན་པ་དང་། །དཔུང་མགོ་ཟླུམ་ཞིང་བརྟན་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will be steady in body, steady in mind, Steady too in diligence, And have steady, rounded shoulders.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །སྟོབས་དང་བྱད་གཟུགས་ཕུན་སུམ་ཚོགས། །ཡན་ལག་ཐམས་ཅད་མཚན་རྣམས་ཀྱིས། །ལེགས་པར་བརྒྱན་ཅིང་ལྡན་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will be strong, perfect in shape and form, And their limbs will be well adorned With all auspicious marks.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །སུམ་ཅུ་རྩ་གསུམ་དབང་ཕྱུག་རྗེ། །རྫུ་འཕྲུལ་ཆེ་བའི་བརྒྱ་བྱིན་དུ། །ལྷ་ཡི་དབང་པོ་ཆེན་པོར་འགྱུར། །
en: “Those who circumambulate a shrine Will be the great lord of the gods, Śakra, whose miraculous powers are great, Lord of the Heaven of the Thirty-Three.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །འཐབ་བྲལ་ལྷ་ཡི་རྒྱལ་པོ་དང་། །དེ་བཞིན་ཡོངས་སུ་དགའ་ལྡན་དང་། །འཕྲུལ་དགའ་གཞན་འཕྲུལ་དབང་བྱེད་འགྱུར། །
en: “Those who circumambulate a shrine Will be king of the gods in the Heaven Without Strife, Or likewise in the Heavens of Joy, Joyful Emanation, or Controlling Others’ Emanations.

source: མཆོད་རྟེན་བསྐོར་བྱས་པས་ནི། །ཚངས་པའི་འཇིག་རྟེན་ཚངས་པ་ཡི། །དབང་ཕྱུག་ཉིད་དུ་དེ་འགྱུར་ཞིང་། །ལྷ་རྣམས་བྱེ་བ་སྙེད་ཀྱིས་མཆོད། །
en: “Those who circumambulate a shrine Will be lord of brahmās In the Brahmā World, Honored by tens of millions of gods.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །བསྐལ་པ་བྱེ་བ་སྟོང་དག་དང་། །ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་དག་ཏུ་ཡང་། །ཤེས་རབ་ལྡན་པ་རྟག་ཏུ་མཆོད། །
en: “Those who circumambulate a shrine Will have wisdom and continually be honored Over tens of billions of eons or, indeed, For millions upon billions of eons.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །བསྐལ་པ་བྱེ་བ་སྟོང་དག་ཏུ། །ལུས་གཙང་གོས་ཀྱང་གཙང་བ་དང་། །དཀར་པོའི་ཆོས་དང་ལྡན་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will have clean bodies, clean clothing, And the immaculate Dharma, For tens of millions of eons.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །སྟོབས་དང་བརྩོན་འགྲུས་ཕུན་སུམ་ཚོགས། །དེ་ནི་ལེ་ལོ་མེད་པ་དང་། །ཤིན་ཏུ་བསྒྲུབ་པ་ཐོབ་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will be endowed with strength and vigor, Have no laziness at all, And achieve the greatest accomplishment.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །བརྩོན་འགྲུས་བརྟན་ཞིང་མཐུ་ཡང་བརྟན། །རྩལ་བརྟན་ཅིས་ཀྱང་མི་ཚུགས་ཤིང་། །དོན་རྣམས་མྱུར་དུ་འགྲུབ་པར་བྱེད། །
en: “Those who circumambulate a shrine Will be steady in diligence, steady in power, Steady in skill, be their own master, And swiftly accomplish their goals.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །གདངས་སྙན་གསང་ཡང་མཐོ་བ་དང་། །ཡིད་དུ་འོང་བའི་ང་རོ་ཅན། །གནོད་པ་མེད་ཅིང་ནད་མེད་འགྱུར། །
en: “Those who circumambulate a shrine Will have melodious speech, A fine, pleasant voice, And be free from harm and illness.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །ང་ཉིད་ཀྱིས་ནི་བསྟན་པ་ཡི། །གནས་དེར་མྱུར་དུ་དེ་འགྲོ་ཞིང་། །ཤས་ཆེར་སྐྱེ་བ་ཐོབ་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will quickly achieve a rebirth In a place I myself have described And have a great urgency there.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི། །སེམས་ཀྱི་ཚད་མེད་བཞི་པོ་དང་། །རྫུ་འཕྲུལ་རྐང་པའི་དབང་ཡང་འཐོབ། །
en: “Those who circumambulate a shrine Will obtain the four applications of mindfulness, The four immeasurable states of mind, And control over the bases of miraculous power.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །འཕགས་པའི་བདེན་པ་བཞི་པོ་དང་། །དབང་པོ་རྣམས་དང་སྟོབས་རྣམས་དང་། །བྱང་ཆུབ་ཡན་ལག་འབྲས་བུ་འཐོབ། །
en: “Those who circumambulate a shrine Will obtain the four noble truths, The faculties, the powers, And the fruition of the factors of awakening.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །མངོན་ཤེས་དྲུག་ལྡན་ཟག་པ་མེད། །ཉོན་མོངས་ཐམས་ཅད་སྤངས་པ་ཡི། །དགྲ་བཅོམ་རྫུ་འཕྲུལ་ཆེན་པོར་འགྱུར། །
en: “Those who circumambulate a shrine Will become arhats, ones with great miraculous powers, Possessing the six supernormal faculties, Without defilement, and all their afflictions dispelled.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །འདོད་ཆགས་ཞེ་སྡང་སྤངས་པ་དང་། །འཁོར་རྣམས་ཐམས་ཅད་སྤངས་པ་ཡི། །རང་རྒྱལ་བྱང་ཆུབ་འཐོབ་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will release attachment and aversion, Release all enmities, And achieve the awakening of a pratyekabuddha.

source: མཆོད་རྟེན་བསྐོར་བ་བྱས་པས་ནི། །འཇིག་རྟེན་དག་ཏུ་དེ་བཞིན་གཤེགས། །མཚན་རྣམས་ཀྱིས་ནི་བརྒྱན་པ་དང་། །གསེར་གྱི་སྐུ་མདོག་འཐོབ་པར་འགྱུར། །
en: “Those who circumambulate a shrine Will become a tathāgata in the world, With a body the color of gold And adorned with the marks.

source: ལུས་ཀྱི་ལས་ཀྱང་བསྐོར་བ་ཡིན། །
en: “Circumambulation is an act of the body.

source: ངག་གི་ལས་ཀྱང་བསྐོར་བ་ཡིན། །
en: Circumambulation is an act of speech.

source: ཡིད་ཀྱི་ལས་ཀྱང་བསྐོར་བ་ཡིན། །
en: Circumambulation is an act of the mind.

source: སྨོན་ལམ་བཏབ་པའང་བསྐོར་བ་ཡིན། །འདིར་ནི་བསྐོར་བ་བྱས་པ་ཡིས། །
en: Circumambulation is also the making of a vow.

source: བགྲོད་དཀའ་བདེ་དགུར་དོན་རྣམས་འགྲུབ། །
en: Here, one easily achieves through circumambulation Goals that are difficult to reach.

source: འཇིག་རྟེན་མགོན་པོའི་མཆོད་རྟེན་ལ། །བསྐོར་བ་བྱས་པའི་ཡོན་ཏན་གང་། །དེ་ནི་ཚིག་ཙམ་ཉི་ཚེ་ཡིས། །ལེགས་པར་བསྟན་པར་མི་ནུས་སོ། །
en: “Mere words cannot well convey, Even slightly, the virtues of those Who perform a circumambulation At a shrine of the World Protector.”

source: སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེའི་ཕྱིར། །ཤ་རིའི་བུས་ནི་ཞུས་ནས་ཀྱང་། །མཆོད་རྟེན་ཕྱག་བྱས་ཡོན་ཏན་གང་། །འཇིག་རྟེན་མགོན་པོས་བསྟན་པ་ཡིན། །རྟ་བརྒྱ་དང་ནི་གསེར་སྲང་བརྒྱ། །
en: When asked by Śāriputra, The World Protector explained The virtues of venerating shrines, Out of compassion for beings.

source: དྲེལ་མོའི་ཤིང་རྟ་བརྒྱ་དག་དང་། །རྒོད་མ་བརྒྱ་ཡི་ཤིང་རྟ་རྣམས། །རིན་ཆེན་སྣ་ཚོགས་བཀང་བ་ཡང་། །བསྐོར་བའི་གོམ་པ་གཅིག་བོར་བའི། །བཅུ་དྲུག་ཆར་ཡང་མི་ཕོད་དོ། །ཀམ་པོ་ཛ་ཡི་བུ་མོ་བརྒྱ། །
en: “A hundred horses, a hundred gold pieces, A hundred mule carts, And a hundred mare-drawn carriages Filled with all manner of jewels Do not add up to even a sixteenth of the worth Of a single step of a circumambulation.

source: ནོར་བུ་རྣ་ཆ་གདུབ་འཁོར་ཐོགས། །གསེར་གྱི་དཔུང་རྒྱན་འཆང་བ་དང་། །མགྲིན་པ་གསེར་གྱིས་ལེགས་བརྒྱན་པ། །བསྐོར་བའི་གོམ་པ་གཅིག་བོར་བའི། །བཅུ་དྲུག་ཆར་ཡང་མི་ཕོད་དོ། །གངས་ཀྱི་གླང་ཆེན་བརྒྱ་སྙེད་དག །
en: “A hundred Kamboja girls Wearing jeweled earrings and bangles, Their upper arms bearing golden armlets, Their necks well adorned with gold necklaces, Do not add up to even a sixteenth of the worth Of a single step of a circumambulation.

source: ལུས་ཆེན་ནམ་ཚོང་ཡངས་པ་དང་། །སྣ་ཡང་གཤོལ་མདའ་འདྲ་བའི་གླང་། །གསེར་དང་ནོར་བུས་བརྒྱན་པ་ཡང་། །བསྐོར་བའི་གོམ་པ་གཅིག་བོར་བའི། །བཅུ་དྲུག་ཆར་ཡང་མི་ཕོད་དོ། །
en: “A hundred Himalayan elephants, With huge bodies, broad chests, And trunks like plows, Adorned with gold and jewels, Do not add up to even a sixteenth of the worth Of a single step of a circumambulation.

source: མཁས་པ་གང་གིས་སངས་རྒྱས་མཆོད་རྟེན་ལ། །དགའ་བའི་སེམས་ཀྱིས་གོམ་པ་གཅིག་བོར་བ། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་སྲང་འབུམ་གྲངས་སྙེད། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “Hundreds of thousands of gold pieces from the Jambu River Are not equal to a single step Taken with a thought of joy by a wise one At shrines of a buddha.

source: མཁས་པ་གང་གིས་སངས་རྒྱས་མཆོད་རྟེན་ལ། །དགའ་བའི་སེམས་ཀྱིས་འཇིམ་གོང་གཅིག་བོར་བ། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་གྱི་ཕོ་བྲང་འབུམ། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “Hundreds of thousands of nuggets of Jambu River gold Are not equal to a single lump of clay Offered with a thought of joy by a wise one At shrines of a buddha.

source: མཁས་པ་གང་གིས་སངས་རྒྱས་མཆོད་རྟེན་ལ། །དགའ་བའི་སེམས་ཀྱིས་མེ་ཏོག་སིལ་མ་སྤུངས། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་སྣོད་འབུམ་བཞག་པ། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “Hundreds of thousands of bowls of Jambu River gold Are not equal to a handful of flower petals Scattered with a thought of joy by a wise one At shrines of a buddha.

source: མཁས་པ་གང་གིས་སངས་རྒྱས་མཆོད་རྟེན་ལ། །དགའ་བའི་སེམས་ཀྱིས་མེ་ཏོག་ཕྲེང་བ་ཐོགས། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་ཁལ་བྱེ་བ་གཉིས། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “Tens of millions of bushels of Jambu River gold Are not equal to a flower garland Held up with a thought of joy by a wise one At shrines of a buddha.

source: མཁས་པ་གང་གིས་སངས་རྒྱས་མཆོད་རྟེན་ལ། །དགའ་བའི་སེམས་ཀྱིས་སྤོས་ཆུས་དབང་བསྐུར་བ། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་གྱི་ཕུང་པོ་འབུམ། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “Hundreds of thousands of heaps of Jambu River gold Are not equal to scented water Sprinkled with a thought of joy by a wise one At shrines of a buddha.

source: མཁས་པ་གང་གིས་སངས་རྒྱས་མཆོད་རྟེན་ལ། །དགའ་བའི་སེམས་ཀྱིས་མར་མེ་འབུལ་བྱེད་པ། །འཛམ་བུའི་ཆུ་ཀླུང་གསེར་སྲང་བྱེ་བ་འབུམ། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “Hundreds of thousands of grams of Jambu River gold Are not equal to an oil lamp Lit with a thought of joy by a wise one At shrines of a buddha.

source: མཁས་པ་གང་གིས་སངས་རྒྱས་མཆོད་རྟེན་ལ། །དགའ་བའི་སེམས་ཀྱིས་རྒྱལ་མཚན་འཕན་གདུགས་ཐོགས། །གསེར་གྱི་རི་བོ་ལྷུན་པོ་ཚད་འབུམ་ཡང་། །དེ་ནི་དེ་དང་མཚུངས་པ་ཡོད་མ་ཡིན། །
en: “Hundreds of thousands of mountains of gold Are not equal to a banner or canopy Raised with a thought of joy by a wise one At shrines of a buddha.

source: འདི་ནི་དཔག་མེད་དེ་བཞིན་གཤེགས། །རྒྱ་མཚོ་འདྲ་བའི་རྫོགས་སངས་རྒྱས། །དེད་དཔོན་བླ་ན་མེད་པ་ལ། །ཕུལ་བའི་ཕན་ཡོན་བསྟན་པ་ཡིན། །
en: “This is the teaching on the benefits Of making offerings to tathāgatas, Perfect buddhas, peerless caravan leaders, Who are limitless, just like the ocean.

source: བཞུགས་པའི་ཚེ་ན་གང་གིས་མཆོད། །མྱ་ངན་འདས་འོག་གང་གིས་མཆོད། །སེམས་དགེ་བ་ནི་མཚུངས་འགྱུར་ན། །བསོད་ནམས་ལ་ནི་ཁྱད་པར་མེད། །
en: “Whether one makes offerings to a living buddha Or makes them to one who has passed into nirvāṇa, There is no difference in merit If the thought is equally devout.

source: དེ་ལྟར་སངས་རྒྱས་བསམ་མི་ཁྱབ། །སངས་རྒྱས་ཆོས་ཀྱང་བསམ་མི་ཁྱབ། །
en: “In this way, buddhas are inconceivable; A buddha’s qualities are also inconceivable.

source: བསམ་མི་ཁྱབ་ལ་དད་རྣམས་ཀྱིས། །རྣམ་པར་སྨིན་པའང་བསམ་མི་ཁྱབ། །
en: For those who have faith in the inconceivable, The karmic fruit is also inconceivable.”

source: མཆོད་རྟེན་བསྐོར་བའི་ཚིགས་སུ་བཅད་པ་རྫོགས་སོ།​། །​།
en: This concludes “The Verses On Circumambulating Shrines.”
